#include "Client_Define.h"
#include "IMGUI_Base.h"

#include "GameInstance.h"


//////////////////////////////////////////////////////// 생성자, 소멸자 ////////////////////////////////////////////////////////
Client::IMGUI_Base::IMGUI_Base()
{
}

Client::IMGUI_Base::IMGUI_Base(ID3D11Device* pDevice, ID3D11DeviceContext* pContext)
	: ImguiWindow(pDevice, pContext)
{
	m_pGameInstance = GameInstance::GetInstance();
	Safe_AddRef(m_pGameInstance);
}

Client::IMGUI_Base::~IMGUI_Base()
{
}
/******************************************************* 생성자, 소멸자 *******************************************************/



//////////////////////////////////////////////////////// 객체 준비 함수 ////////////////////////////////////////////////////////
HRESULT Client::IMGUI_Base::Initialize(void* arg)
{
	m_WindowTitle = "IMGUI_Base";

	return S_OK;
}
/******************************************************* 객체 준비 함수 *******************************************************/



//////////////////////////////////////////////////////// 렌더 함수 ////////////////////////////////////////////////////////
_uint Client::IMGUI_Base::Update_Contents(_float fTimeDelta)
{


	return 0;
}
/******************************************************* 객체 준비 함수 *******************************************************/



//////////////////////////////////////////////////////// 렌더 함수 ////////////////////////////////////////////////////////
_int Client::IMGUI_Base::Render(const _float fTimeDelta)
{
	return S_OK;
}
/******************************************************* 렌더 함수 *******************************************************/



//////////////////////////////////////////////////////// 생성자 호출 함수 ////////////////////////////////////////////////////////
IMGUI_Base* Client::IMGUI_Base::Create(ID3D11Device* pDevice, ID3D11DeviceContext* pContext, void* arg)
{
	IMGUI_Base* pInstance = new IMGUI_Base(pDevice, pContext);

	MSG_FAIL(pInstance->Initialize(arg), L"IMGUI_Base 원본 생성 실패", L"경고!!!", nullptr);

	return pInstance;
}
/******************************************************* 생성자 호출 함수 *******************************************************/



//////////////////////////////////////////////////////// 객체 반환 함수 ////////////////////////////////////////////////////////
void Client::IMGUI_Base::Free()
{
	__super::Free();
	Safe_Release(m_pGameInstance);
}
/******************************************************* 객체 반환 함수 *******************************************************/
