#include "Client_Define.h"
#include "MState_Dead.h"
#include "GameObject.h"
#include "Monster.h"


//////////////////////////////////////////////////////// 생성자, 소멸자 ////////////////////////////////////////////////////////
Client::MState_Dead::MState_Dead()
{
}
/******************************************************* 생성자, 소멸자 *******************************************************/



//////////////////////////////////////////////////////// 객체 준비 함수 ////////////////////////////////////////////////////////
HRESULT Client::MState_Dead::Initialize(GameObject* pOwner, _uint iAnimIdx, _float fSpeed)
{
	__super::Initialize(pOwner, iAnimIdx, fSpeed);

	return S_OK;
}
/******************************************************* 객체 준비 함수 *******************************************************/



//////////////////////////////////////////////////////// 상태 진입 ////////////////////////////////////////////////////////
void Client::MState_Dead::Enter_State()
{
	CHECK_JUST_NULL(m_pMonster);

	// 몸 돌리기 끔
	m_pMonster->Set_TurnType(Monster::TURN_END);
	m_pMonster->Set_Animation_CS(m_iAnimIdx, m_fAnimSpeed);
	m_pMonster->OnDead();
}
/******************************************************* 상태 진입 *******************************************************/



//////////////////////////////////////////////////////// 상태 업데이트 ////////////////////////////////////////////////////////
void Client::MState_Dead::Update_State(_float fTimeDelta)
{
	CHECK_JUST_NULL(m_pMonster);
}
/******************************************************* 상태 업데이트 *******************************************************/



//////////////////////////////////////////////////////// 상태 탈출 ////////////////////////////////////////////////////////
void Client::MState_Dead::Exit_State()
{
	CHECK_JUST_NULL(m_pMonster);

}
/******************************************************* 상태 탈출 *******************************************************/



//////////////////////////////////////////////////////// 생성자 호출 함수 ////////////////////////////////////////////////////////
MState_Dead* Client::MState_Dead::Create(GameObject* pOwner, _uint iAnimIdx, _float fSpeed)
{
	MState_Dead* pInstance = new MState_Dead();

	MSG_FAIL(pInstance->Initialize(pOwner, iAnimIdx, fSpeed), L"MState_Dead 원본 생성 실패", L"경고!!!", nullptr);

	return pInstance;
}
/******************************************************* 생성자 호출 함수 *******************************************************/



//////////////////////////////////////////////////////// 객체 반환 함수 ////////////////////////////////////////////////////////
void Client::MState_Dead::Free()
{
	__super::Free();
}
/******************************************************* 객체 반환 함수 *******************************************************/
