#include "Client_Define.h"
#include "MState_Awake.h"
#include "GameObject.h"
#include "Monster.h"


//////////////////////////////////////////////////////// 생성자, 소멸자 ////////////////////////////////////////////////////////
Client::MState_Awake::MState_Awake()
{
}
/******************************************************* 생성자, 소멸자 *******************************************************/



//////////////////////////////////////////////////////// 객체 준비 함수 ////////////////////////////////////////////////////////
HRESULT Client::MState_Awake::Initialize(GameObject* pOwner, _uint iAnimIdx, _float fSpeed)
{
	__super::Initialize(pOwner, iAnimIdx, fSpeed);

	return S_OK;
}
/******************************************************* 객체 준비 함수 *******************************************************/



//////////////////////////////////////////////////////// 상태 진입 ////////////////////////////////////////////////////////
void Client::MState_Awake::Enter_State()
{
	// 몬스터가 깨어난다
	CHECK_JUST_NULL(m_pMonster);

	// 깨어나는 애니메이션으로 세팅
	m_pMonster->Set_Animation_CS(m_iAnimIdx, m_fAnimSpeed, false);
}
/******************************************************* 상태 진입 *******************************************************/



//////////////////////////////////////////////////////// 상태 업데이트 ////////////////////////////////////////////////////////
void Client::MState_Awake::Update_State(_float fTimeDelta)
{
	// 깨어나는 몬스터는
	CHECK_JUST_NULL(m_pMonster);

	// 깨어나는 애니메이션이 끝나면
	if (m_pMonster->Is_Animation_Finished())
	{
		// 바로 전투상태가 된다
		m_pStateMachine->Change_State(_UINT(Monster::MS_BATTLE));
	}

}
/******************************************************* 상태 업데이트 *******************************************************/



//////////////////////////////////////////////////////// 상태 탈출 ////////////////////////////////////////////////////////
void Client::MState_Awake::Exit_State()
{
	CHECK_JUST_NULL(m_pMonster);

}
/******************************************************* 상태 탈출 *******************************************************/



//////////////////////////////////////////////////////// 생성자 호출 함수 ////////////////////////////////////////////////////////
MState_Awake* Client::MState_Awake::Create(GameObject* pOwner, _uint iAnimIdx, _float fSpeed)
{
	MState_Awake* pInstance = new MState_Awake();

	MSG_FAIL(pInstance->Initialize(pOwner, iAnimIdx, fSpeed), L"MState_Awake 원본 생성 실패", L"경고!!!", nullptr);

	return pInstance;
}
/******************************************************* 생성자 호출 함수 *******************************************************/



//////////////////////////////////////////////////////// 객체 반환 함수 ////////////////////////////////////////////////////////
void Client::MState_Awake::Free()
{
	__super::Free();
}
/******************************************************* 객체 반환 함수 *******************************************************/
